# 题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
import os

def bonus (I):
    if I <= 100000 and I >= 0:
        profit = I * 0.1
        return profit
    elif I >= 100000 and I <= 200000:
        profit = 100000 * 0.1 + (I-100000) * 0.075
        return profit
    elif I >= 200000 and I <= 400000:
        profit = 100000 * 0.1 + 100000 * 0.075 + (I - 200000) * 0.05
        return profit
    elif I >= 400000 and I <= 600000:
        profit =  100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (I - 400000) * 0.03
        return profit
    elif I >= 600000 and I <= 1000000:
        profit = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (I - 600000) * 0.015
        return profit
    elif I >= 1000000 :
        profit = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (I - 1000000) * 0.001
        return profit
    else:
        print(f"您输入的 {I} 是负数，请核对！")



if __name__ == "__main__":
    # 检查是否以管理员身份运行（仅Windows）
    i =int(input("请输入企业利润："))
    print(f"您的奖金有 {bonus(i)}")


    #!/usr/bin/python3
 

# 以下是参考答案：
# i = int(input('净利润:'))
# arr = [1000000,600000,400000,200000,100000,0]
# rat = [0.01,0.015,0.03,0.05,0.075,0.1]
# r = 0
# for idx in range(0,6):
#     if i>arr[idx]:
#         r+=(i-arr[idx])*rat[idx]
#         print ((i-arr[idx])*rat[idx])
#         i=arr[idx]
# print (r)